<a href="https://colab.research.google.com/github/sadullahmath/Exercise/blob/master/Applying_Pipelines_to_a_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Applying Pipelines to a Dataset

In [1]:
# Creating a numpy array using np.arange and reshaping it
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(20).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [2]:
# Creating column names
df.columns = ['A','B','C','D']
df

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [3]:
# Create a new df by removing one column
df1 = df.pop('D')
print('Printing new data frame')
print(df1)
print('Printing old data frame')
print(df)

Printing new data frame
0     3
1     7
2    11
3    15
4    19
Name: D, dtype: int64
Printing old data frame
    A   B   C
0   0   1   2
1   4   5   6
2   8   9  10
3  12  13  14
4  16  17  18